<a href="https://colab.research.google.com/github/recervictory/LearingPython/blob/Student/08%20-%20Pandas%20III%20-%20Data%20Cleaning%20and%20Preparation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning and Preparation

During the course of doing data analysis and modeling, a *significant amount of time* is spent on data preparation: loading, cleaning, transforming, and rearranging. Such tasks are often reported to take up *80% or more of an analystâ€™s time*.

In [2]:
import pandas as pd
import numpy as np
from numpy import nan as NA # represent NaN as NA

## A. Handling Missing Data
Missing data occurs commonly in many data analysis applications. One of the goals
of pandas is to make working with missing data as painless as possible. For example,
all of the descriptive statistics on pandas objects exclude missing data by default.

The way that missing data is represented in pandas objects is somewhat imperfect,
but it is functional for a lot of users. For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data.

The built-in Python **None** value is also treated as NA in object arrays:

In [ ]:
string_data = pd.Series(['Kolkata', 'Delhi', np.nan, 'Bangalore'])
string_data

0      Kolkata
1        Delhi
2          NaN
3    Bangalore
dtype: object

In [ ]:
# Is any value null/ none /nan
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
# The built-in Python None value is also treated as NA in object arrays: None, NA, nan
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### NA handling methods
- `dropna` Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.
- `fillna` Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
- `isnull` Return boolean values indicating which values are missing/NA.
- `notnull` Negation of isnull

### Filtering Out Missing Data
While you always have the option to do it by hand using `pandas.isnull` and boolean indexing, the `dropna` can be helpful.

In [ ]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
# Droping the Data
data.dropna() # not permanent

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
# This is equivalent to:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any `NAs`. 
The `dropna` by default drops **any row containing a missing value**:

In [ ]:
 
 data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
 cleaned = data.dropna()
 cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
# check col wise missing value
data.isnull().sum()

0    2
1    2
2    2
dtype: int64

In [ ]:
# Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

In [ ]:
# To drop columns in the same way, pass axis=1:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
# Drop data column wise 
# in python 
# axis = 1 col
# axis = 0 : row
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### Filling In Missing Data
For most purposes, the fillna method is the workhorse function to use. Calling fillna with a **constant** replaces **missing values** with that value:

In [ ]:
# df created
df = pd.DataFrame(np.random.randn(7, 3), columns=['gold', 'silver', 'copper'])
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

       gold    silver    copper
0  0.960932       NaN       NaN
1  1.455036       NaN       NaN
2  1.334481       NaN -1.208838
3 -1.001076       NaN  2.365561
4 -0.360475  0.525528  1.530065
5  0.241174  0.083004 -0.299816
6 -1.156792 -1.296698  1.883608

In [ ]:
# Fill The missing values with Zero
df.fillna(0)

       gold    silver    copper
0  0.960932  0.000000  0.000000
1  1.455036  0.000000  0.000000
2  1.334481  0.000000 -1.208838
3 -1.001076  0.000000  2.365561
4 -0.360475  0.525528  1.530065
5  0.241174  0.083004 -0.299816
6 -1.156792 -1.296698  1.883608

In [ ]:
# Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({'silver': -1, 'copper': 1})

       gold    silver    copper
0  0.960932 -1.000000  1.000000
1  1.455036 -1.000000  1.000000
2  1.334481 -1.000000 -1.208838
3 -1.001076 -1.000000  2.365561
4 -0.360475  0.525528  1.530065
5  0.241174  0.083004 -0.299816
6 -1.156792 -1.296698  1.883608

In [ ]:
# fillna returns a new object, but you can modify the existing object in-place:
df.fillna(0)
df

       gold    silver    copper
0  0.960932       NaN       NaN
1  1.455036       NaN       NaN
2  1.334481       NaN -1.208838
3 -1.001076       NaN  2.365561
4 -0.360475  0.525528  1.530065
5  0.241174  0.083004 -0.299816
6 -1.156792 -1.296698  1.883608

In [ ]:
df.fillna(0, inplace=True) # Important
df

       gold    silver    copper
0  0.960932  0.000000  0.000000
1  1.455036  0.000000  0.000000
2  1.334481  0.000000 -1.208838
3 -1.001076  0.000000  2.365561
4 -0.360475  0.525528  1.530065
5  0.241174  0.083004 -0.299816
6 -1.156792 -1.296698  1.883608

The same **interpolation** methods available for reindexing can be used with fillna:

In [ ]:
# Creating Dataframe
df = pd.DataFrame(np.random.randn(8, 3), columns=['gold', 'silver', 'copper'])
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

       gold    silver    copper
0  0.159362  0.527933  1.037528
1 -0.596954  1.031973 -0.395796
2  0.501706       NaN  0.790893
3  0.379001       NaN -0.332592
4 -1.497654       NaN       NaN
5  0.633566       NaN       NaN
6  0.945829       NaN       NaN
7 -1.339841       NaN       NaN

In [ ]:
# Fill 'NA' with forword fill method
df.fillna(method='ffill')

       gold    silver    copper
0  0.611627 -0.148583 -0.680851
1 -0.784319 -0.310510 -0.314903
2  1.517101 -0.310510 -0.349676
3  0.987027 -0.310510  0.007926
4 -3.077174 -0.310510  0.007926
5  0.726522 -0.310510  0.007926
6  0.106931 -0.310510  0.007926
7  0.993971 -0.310510  0.007926

In [ ]:
# limit by row
df.fillna(method='ffill', limit=3)

       gold    silver    copper
0  0.611627 -0.148583 -0.680851
1 -0.784319 -0.310510 -0.314903
2  1.517101 -0.310510 -0.349676
3  0.987027 -0.310510  0.007926
4 -3.077174 -0.310510  0.007926
5  0.726522       NaN  0.007926
6  0.106931       NaN  0.007926
7  0.993971       NaN       NaN

In [ ]:
# you might pass the mean or median values
df.fillna(df.max())

       gold    silver    copper
0  0.159362  0.527933  1.037528
1 -0.596954  1.031973 -0.395796
2  0.501706  1.031973  0.790893
3  0.379001  1.031973 -0.332592
4 -1.497654  1.031973  1.037528
5  0.633566  1.031973  1.037528
6  0.945829  1.031973  1.037528
7 -1.339841  1.031973  1.037528

In [ ]:
df.fillna(df.mean(),inplace=True)
df

       gold    silver    copper
0  0.611627 -0.148583 -0.680851
1 -0.784319 -0.310510 -0.314903
2  1.517101 -0.229546 -0.349676
3  0.987027 -0.229546  0.007926
4 -3.077174 -0.229546 -0.334376
5  0.726522 -0.229546 -0.334376
6  0.106931 -0.229546 -0.334376
7  0.993971 -0.229546 -0.334376

In [ ]:
df['category'] = [NA,'A','B',NA,'A','C','A','B']
df

       gold    silver    copper category
0  0.159362  0.527933  1.037528      NaN
1 -0.596954  1.031973 -0.395796        A
2  0.501706       NaN  0.790893        B
3  0.379001       NaN -0.332592      NaN
4 -1.497654       NaN       NaN        A
5  0.633566       NaN       NaN        C
6  0.945829       NaN       NaN        A
7 -1.339841       NaN       NaN        B

In [ ]:
df['category'].mode()[0] # Fisrt one

'A'

In [ ]:
df['category'].fillna(df['category'].mode()[0], inplace=True) # mode most freq
df

       gold    silver    copper category
0  0.159362  0.527933  1.037528        A
1 -0.596954  1.031973 -0.395796        A
2  0.501706       NaN  0.790893        B
3  0.379001       NaN -0.332592        A
4 -1.497654       NaN       NaN        A
5  0.633566       NaN       NaN        C
6  0.945829       NaN       NaN        A
7 -1.339841       NaN       NaN        B

## B. Data Transformation

### Removing Duplicates
Duplicate rows may be found in a DataFrame for any number of reasons. Here is an example:

In [ ]:
data = pd.DataFrame({'city': ['kolkata', 'delhi'] * 3 + ['delhi'],'count': [1, 1, 2, 3, 3, 4, 4]})
data

      city  count
0  kolkata      1
1    delhi      1
2  kolkata      2
3    delhi      3
4  kolkata      3
5    delhi      4
6    delhi      4

The DataFrame method `duplicated()` returns a **boolean Series** indicating whether each row is a duplicate (has been observed in a previous row) or not:

In [ ]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

The `drop_duplicates()` returns a DataFrame where the duplicated array is False:

In [ ]:
data.drop_duplicates()

      city  count
0  kolkata      1
1    delhi      1
2  kolkata      2
3    delhi      3
4  kolkata      3
5    delhi      4

In [ ]:
data['price'] = np.random.randint(10,100,size=7)
data

      city  count  price
0  kolkata      1     57
1    delhi      1     44
2  kolkata      2     91
3    delhi      3     23
4  kolkata      3     39
5    delhi      4     61
6    delhi      4     78

In [ ]:
 # Drop duplicate by column
 data.drop_duplicates(['count'])

      city  count  price
0  kolkata      1     57
2  kolkata      2     91
3    delhi      3     23
5    delhi      4     61

### Transforming Data Using a Function or Mapping
For many datasets, you may wish to perform some transformation based on the values in an array, Series, or column in a DataFrame.

In [ ]:
data = pd.DataFrame({'city':['New York','Delhi','Kolkata','Chicago','Las Vegas'], 
                     'pupulation': np.random.randint(100000,1000000000,size=5)
                     })
data

        city  pupulation
0   New York   731581758
1      Delhi   855141249
2    Kolkata    39045168
3    Chicago   795039675
4  Las Vegas   487601410

In [ ]:
city_to_country = {'new york':'usa','delhi':'india','kolkata':'india','chicago':'usa','las vegas':'usa'}
city_to_country

{'chicago': 'usa',
 'delhi': 'india',
 'kolkata': 'india',
 'las vegas': 'usa',
 'new york': 'usa'}

In [ ]:
# We Need to cheack the data type
data.dtypes

city          object
pupulation     int64
dtype: object

In [ ]:
data['city'] = data['city'].str.lower()
data

        city  pupulation
0   new york   731581758
1      delhi   855141249
2    kolkata    39045168
3    chicago   795039675
4  las vegas   487601410

In [ ]:
data['country'] = data['city'].map(city_to_country)
data

        city  pupulation country
0   new york   731581758     usa
1      delhi   855141249   india
2    kolkata    39045168   india
3    chicago   795039675     usa
4  las vegas   487601410     usa

In [ ]:
zip = {'usa': '+1','india':'+91','uk':'+7'}
data['zip'] = data['country'].map(zip)
data

        city  pupulation country  zip
0   new york   731581758     usa   +1
1      delhi   855141249   india  +91
2    kolkata    39045168   india  +91
3    chicago   795039675     usa   +1
4  las vegas   487601410     usa   +1

### Replacing Values
Filling in missing data with the `fillna()` method is a special case of more general value replacement. As youâ€™ve already seen, `map()` can be used to modify a subset of values in an object but replace provides a simpler and more flexible way to do so.

In [ ]:
data['pupulation'] = data['pupulation'].replace([843448647,127963973	],np.nan)
data

        city  pupulation country  zip
0   new york   731581758     usa   +1
1      delhi   855141249   india  +91
2    kolkata    39045168   india  +91
3    chicago   795039675     usa   +1
4  las vegas   487601410     usa   +1

### Detecting and Filtering Outliers
Filtering or transforming **outliers** is largely a matter of applying array operations. Consider a DataFrame with some normally distributed data:

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4),columns=['Aaba','Baba','Caca','Dada'])

# Lets find out the outliers
data.describe()

              Aaba         Baba         Caca         Dada
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014128    -0.028830    -0.009874     0.004128
std       0.981378     0.962308     1.001781     1.027538
min      -2.964888    -3.355816    -3.549110    -3.167404
25%      -0.710339    -0.686079    -0.679527    -0.654529
50%      -0.012924    -0.024915    -0.062036     0.036778
75%       0.667580     0.629801     0.670944     0.725620
max       3.238140     2.930522     3.342285     2.978472

In [ ]:
data[np.abs(data['Caca']) > 3]

         Aaba      Baba      Caca      Dada
157 -1.459662  0.067723 -3.034796  1.111442
260  1.419877  0.725150  3.342285 -0.088954
645  1.001509 -0.440654 -3.549110 -0.188530

In [ ]:
# Detecting outleirs from any columns in the dataframe

data[(np.abs(data) > 3).any(1)] # axis = 1 i.e column wise

         Aaba      Baba      Caca      Dada
39   1.455963 -3.116615 -0.111660 -0.775272
46   1.100756 -0.036092  1.373986 -3.167404
157 -1.459662  0.067723 -3.034796  1.111442
260  1.419877  0.725150  3.342285 -0.088954
444  1.261487  1.118862  0.315600 -3.092298
504 -0.687179 -3.115978  1.511751  0.653478
518 -1.375066 -3.110294  0.935354  0.956307
645  1.001509 -0.440654 -3.549110 -0.188530
688  3.238140  0.435656 -0.571016 -1.438396
828  0.224491 -3.355816  0.763214 -0.383391
836  0.112581 -3.246067  0.279451 -1.012459
852  3.077381 -1.593965 -1.614326 -1.066925

In [ ]:
data[(np.abs(data) > 3).all(1)]

Empty DataFrame
Columns: [Aaba, Baba, Caca, Dada]
Index: []

In [ ]:
new_row = {'Aaba' : 4,	'Baba':4,	'Caca': -4,	'Dada': -4}
data = data.append(new_row,ignore_index=True)
data[(np.abs(data) > 3).all(1)]

      Aaba  Baba  Caca  Dada
1000   4.0   4.0  -4.0  -4.0

# Project: Risk of being drawn into online sex work

### Context
This database was used in the paper: Covert online ethnography and machine learning for detecting individuals at risk of being drawn into online sex work. 2018 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM), Barcelona, Spain, 28-31 August.

### Content
The database includes data scraped from a European online adult forum. Using covert online ethnography we interviewed a small number of participants and determined their risk to either supply or demand sex services through that forum. This is a great dataset for semi-supervised learning.

### Inspiration
How can we identify individuals at risk of being drawn into online sex work? The spread of online social media enables a greater number of people to be involved into online sex trade; however, detecting deviant behaviors online is limited by the low available of data. To overcome this challenge, we combine covert online ethnography with semi-supervised learning using data from a popular European adult forum.

## Importing Data

In [3]:
import pandas as pd
import numpy as np

import warnings; warnings.filterwarnings('ignore')

In [4]:
# Created a dataframe named it df
# loaded un-cleaned data
df = pd.read_csv('/content/online_sex_work.csv', index_col=0)
# sub part of data
df = df.iloc[: 28831, :]

df.head() # six rows

        Gender  ...     Risk
User_ID         ...
10386.0   male  ...  No_risk
14.0      male  ...  No_risk
16721.0   male  ...  No_risk
16957.0   male  ...  No_risk
17125.0   male  ...  No_risk

[5 rows x 17 columns]

In [5]:
df.tail() # last 6  rows

         Gender   Age Location  ... Profile_pictures Friends_ID_list          Risk
User_ID                         ...
9962.0     male  27,2        J  ...              0.0             NaN  unknown_risk
9964.0     male  46,4        J  ...              0.0             NaN  unknown_risk
9966.0     male  28,8        C  ...              0.0             NaN  unknown_risk
9968.0     male  31,5        J  ...              0.0             NaN  unknown_risk
998.0    female  38,7        F  ...              1.0             NaN  unknown_risk

[5 rows x 17 columns]

In [6]:
# Understand the Data Types
df.dtypes

Gender                                  object
Age                                     object
Location                                object
Verification                            object
Sexual_orientation                      object
Sexual_polarity                         object
Looking_for                             object
Points_Rank                             object
Last_login                              object
Member_since                            object
Number_of_Comments_in_public_forum      object
Time_spent_chating_H:M                  object
Number_of_advertisments_posted         float64
Number_of_offline_meetings_attended    float64
Profile_pictures                       float64
Friends_ID_list                         object
Risk                                    object
dtype: object

## Data Cleaning

### Change datatype for some features

Data in a number of features that contain numerical data could be converted into pure numbers (integers), which would take less memory and could be interpreted more easily by machine learning models.

In [7]:
df.index = df.index.astype(int) # change the type to int
df['Number_of_advertisments_posted'] = df['Number_of_advertisments_posted'].astype(int)
df['Number_of_offline_meetings_attended'] = df['Number_of_offline_meetings_attended'].astype(int)
df['Profile_pictures'] = df['Profile_pictures'].astype(int)
df['Friends_ID_list'] = df['Friends_ID_list'].astype(str)
df['Risk'] = df['Risk'].astype(str)

df.head()

        Gender  ...     Risk
User_ID         ...
10386     male  ...  No_risk
14        male  ...  No_risk
16721     male  ...  No_risk
16957     male  ...  No_risk
17125     male  ...  No_risk

[5 rows x 17 columns]

In [8]:
df.dtypes

Gender                                 object
Age                                    object
Location                               object
Verification                           object
Sexual_orientation                     object
Sexual_polarity                        object
Looking_for                            object
Points_Rank                            object
Last_login                             object
Member_since                           object
Number_of_Comments_in_public_forum     object
Time_spent_chating_H:M                 object
Number_of_advertisments_posted          int64
Number_of_offline_meetings_attended     int64
Profile_pictures                        int64
Friends_ID_list                        object
Risk                                   object
dtype: object

In [11]:
# cheack the Error
df['Number_of_Comments_in_public_forum'] = df['Number_of_Comments_in_public_forum'].astype(int)

In [10]:
# We use replace method to replace a pattern from string
df['Number_of_Comments_in_public_forum'] = df['Number_of_Comments_in_public_forum'].str.replace(' ', '').astype(int)

In [15]:
df.dtypes

Gender                                 object
Age                                    object
Location                               object
Verification                           object
Sexual_orientation                     object
Sexual_polarity                        object
Looking_for                            object
Points_Rank                            object
Last_login                             object
Member_since                           object
Number_of_Comments_in_public_forum      int64
Time_spent_chating_H:M                 object
Number_of_advertisments_posted          int64
Number_of_offline_meetings_attended     int64
Profile_pictures                        int64
Friends_ID_list                        object
Risk                                   object
dtype: object

### Counting the Missing Values

In [16]:
# Count of missing values column wise
df.isnull().sum()

Gender                                   4
Age                                      0
Location                                 1
Verification                             0
Sexual_orientation                       1
Sexual_polarity                          1
Looking_for                            425
Points_Rank                              0
Last_login                               0
Member_since                             0
Number_of_Comments_in_public_forum       0
Time_spent_chating_H:M                   0
Number_of_advertisments_posted           0
Number_of_offline_meetings_attended      0
Profile_pictures                         0
Friends_ID_list                          0
Risk                                     0
dtype: int64

### Convert `Gender` to binary data

In the `Gender` column, We fill some missing values using some simple conditions (if the entry is, for example, homosexual, and looking for men, we fill that entry with `male`), using the `fill_gender_na` function below. Then in every entry, we change the data to whether it specifies `female` or not.

In [19]:
def fill_gender_na(row):
    if row['Sexual_orientation'] == 'Homosexual':
        if row['Gender'] == 'male':
            return 'Men'
        elif row['Gender'] == 'female':
            return 'Women'
    elif row['Sexual_orientation'] == 'Heterosexual':
        if row['Gender'] == 'female':
            return 'Men'
        elif row['Gender'] == 'male':
            return 'Women'
    return np.nan

In [20]:
## Fill the missing data
fill_values = df.apply(fill_gender_na, axis=1)
df['Looking_for'].fillna(fill_values, inplace=True)

In [23]:
# Lets check the missing values
df.isnull().sum()

Gender                                 4
Age                                    0
Location                               1
Verification                           0
Sexual_orientation                     1
Sexual_polarity                        1
Looking_for                            0
Points_Rank                            0
Last_login                             0
Member_since                           0
Number_of_Comments_in_public_forum     0
Time_spent_chating_H:M                 0
Number_of_advertisments_posted         0
Number_of_offline_meetings_attended    0
Profile_pictures                       0
Friends_ID_list                        0
Risk                                   0
dtype: int64

In [22]:
# Add missing value with summary statistics 
df['Looking_for'].fillna(df['Looking_for'].mode()[0], inplace=True)
df.head()

        Gender  ...     Risk
User_ID         ...
10386     male  ...  No_risk
14        male  ...  No_risk
16721     male  ...  No_risk
16957     male  ...  No_risk
17125     male  ...  No_risk

[5 rows x 17 columns]

In [25]:
df['Gender'].fillna(df['Gender'].mode()[0], inplace=True)
df.head()

        Gender  ...     Risk
User_ID         ...
10386     male  ...  No_risk
14        male  ...  No_risk
16721     male  ...  No_risk
16957     male  ...  No_risk
17125     male  ...  No_risk

[5 rows x 17 columns]

In [26]:
# Lets check the missing values
df.isnull().sum()

Gender                                 0
Age                                    0
Location                               1
Verification                           0
Sexual_orientation                     1
Sexual_polarity                        1
Looking_for                            0
Points_Rank                            0
Last_login                             0
Member_since                           0
Number_of_Comments_in_public_forum     0
Time_spent_chating_H:M                 0
Number_of_advertisments_posted         0
Number_of_offline_meetings_attended    0
Profile_pictures                       0
Friends_ID_list                        0
Risk                                   0
dtype: int64

### Insert new Binary column named 'Female'

In [31]:
df.insert(5, 'Female5', df['Gender'] == 'female')
df.head()

         Female  ...     Risk
User_ID          ...
10386     False  ...  No_risk
14        False  ...  No_risk
16721     False  ...  No_risk
16957     False  ...  No_risk
17125     False  ...  No_risk

[5 rows x 20 columns]

### Missing values in `Location`

In [28]:
df['Location'].fillna(df['Location'].mode()[0], inplace=True)

### Decimal points in `Age`

We replace all commas (European decimal separator) with periods, while handling some unformatted values.

In [32]:
def comma_replace(obj):
  return obj.replace(",",".")

df['Age'].head().apply(comma_replace)# apply col wise

User_ID
10386    34.6
14       32.2
16721    33.6
16957      34
17125    39.5
Name: Age, dtype: object

In [33]:
# Lets do with single line with lambda
df['Age'] = df['Age'].apply(lambda obj: obj.replace(',', '.'))
df.head()

         Female  ...     Risk
User_ID          ...
10386     False  ...  No_risk
14        False  ...  No_risk
16721     False  ...  No_risk
16957     False  ...  No_risk
17125     False  ...  No_risk

[5 rows x 20 columns]

In [34]:
# Error: Convering age to numeric
pd.to_numeric(df['Age'])

ValueError: ignored

In [35]:
# Method 1
df['Age'] = df['Age'].replace('???', np.nan)
df['Age'] = df['Age'].astype(float)

In [36]:
# Method 2
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [37]:
# Lets check the missing values
df.isnull().sum()

Female                                 0
Female1                                0
Gender                                 0
Age                                    6
Location                               0
Female5                                0
Verification                           0
Sexual_orientation                     1
Sexual_polarity                        1
Looking_for                            0
Points_Rank                            0
Last_login                             0
Member_since                           0
Number_of_Comments_in_public_forum     0
Time_spent_chating_H:M                 0
Number_of_advertisments_posted         0
Number_of_offline_meetings_attended    0
Profile_pictures                       0
Friends_ID_list                        0
Risk                                   0
dtype: int64

In [38]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [39]:
df.isnull().sum()

Female                                 0
Female1                                0
Gender                                 0
Age                                    0
Location                               0
Female5                                0
Verification                           0
Sexual_orientation                     1
Sexual_polarity                        1
Looking_for                            0
Points_Rank                            0
Last_login                             0
Member_since                           0
Number_of_Comments_in_public_forum     0
Time_spent_chating_H:M                 0
Number_of_advertisments_posted         0
Number_of_offline_meetings_attended    0
Profile_pictures                       0
Friends_ID_list                        0
Risk                                   0
dtype: int64

### Convert `Verification` to binary data

In every entry, we change the data to whether the user is verified or not.

In [ ]:
df['Verification'] = df['Verification'] != 'Non_Verified'
df[['Verification']].head()